Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/educational_supports/schools_and_information_technology.html.txt.tmx
Source language: en
Languages: ga

source: Schools and information technology
ga: Scoileanna agus teicneolaíocht faisnéise

source: • Professional Development Service for Teachers (PDST)
ga: • An tSeirbhís um Fhorbairt Ghairmiúil do Mhúinteoirí (PDST)

source: • ICT in Schools Programme
ga: • An Clár TFC i Scoileanna

source: The Department of Education and Skills (DES) is responsible for developing Information and Communications Technology (ICT) in schools
ga: Tá an Roinn Oideachais agus Scileanna (DES) freagrach as Teicneolaíocht Faisnéise agus Cumarsáide (TFC) i scoileanna a fhorbairt

source: It aims to help teachers to incorporate ICT into their skill sets and teaching practice, and to develop curriculum and learning resources that make use of ICT
ga: Tá sé mar chuspóir cabhrú le múinteoirí chun TFC a ionchorprú isteach ina sraitheanna scileanna agus cleachtas múinteoireachta, agus chun acmhainní curaclaim agus foghlama a fhorbairt a úsáideann TFC

source: This document outlines the strategies and programmes in place to achieve these aims
ga: Tugtar breac-chuntas sa cháipéis seo ar na straitéisí agus na cláir atá i bhfeidhm chun na cuspóirí seo a bhaint amach

source: Most of these programmes are operated and managed by the Professional Development Service for Teachers (PDST)
ga: Déanann an tSeirbhís um Fhorbairt Ghairmiúil do Mhúinteoirí (PDST) mórchuid na gclár seo a fheidhmiú agus a bhainistiú

source: Professional Development Service for Teachers (PDST)
ga: An tSeirbhís um Fhorbairt Ghairmiúil do Mhúinteoirí (PDST)

source: From 1st June 2012, the role and functions of the National Centre for Technology in Education (NCTE) come under the remit of the Professional Development Service for Teachers
ga: Ón 1 Meitheamh 2012, tagann feidhmeanna agus ról an Lárionaid Náisiúnta do Theicneolaíocht san Oideachas (NCTE) faoi chuimsiú na Seirbhíse um Fhorbairt Ghairmiúil do Mhúinteoirí

source: The PDST provides advice and support to the Department and other bodies on the development and use of ICT in education
ga: Cuireann an PDST comhairle agus tacaíocht ar fáil don Roinn agus do chomhlachtaí eile ar fhorbairt agus úsáid TFC san oideachas

source: It also provides a number of ICT support services to schools through:
ga: Ina theannta sin, cuireann siad roinnt seirbhísí tacaíochta TFC ar fáil do scoileanna tríd an méid a leanas:

source: • Designing and implementing a series of in-career ICT training programmes for teachers
ga: • Sraith cláir inghairme oiliúna TFC a dhearadh agus a chur i bhfeidhm do mhúinteoirí

source: • Developing and maintaining ScoilNet - an online educational portal. It has also responsibility for the development of other websites with specific relevance to the curriculum
ga: • ScoilNet a fhorbairt agus a chothabháil – tairseach oideachasúil ar líne Ina theannta sin, tá siad freagrach as forbairt láithreán gréasáin eile ag a bhfuil baint ar leith leis an gcuraclam

source: • Supporting and facilitating school leadership in e-learning planning
ga: • Ceannaireacht scoile a éascú agus tacú léi i bpleanáil ríomhfhoghlama

source: • Supporting the innovative use and integration of ICT in schools through pilot projects
ga: • Tacú le húsáid agus comhtháthú nuálaíoch TFC i scoileanna trí thionscadail phíolótacha

source: • Providing a general ICT advice service to schools
ga: • Seirbhís ghinearálta chomhairle TFC a chur ar fáil do scoileanna

source: PDST is responsible for coordinating the Schools Broadband Programme
ga: Tá an PDST freagrach as an gClár leathanbhanda le haghaidh Scoileanna a chomhordú

source: This provides integrated services, including broadband connectivity, and hosted services, such as content filtering, web hosting-blogging and security services
ga: Cuireann seo seirbhís chomhtháite ar fáil, lena n-áirítear nascacht leathanbhanda, agus seirbhísí óstáilte, ar nós scagadh ábhair, óstáil-blagáil gréasáin agus seirbhísí slándála

source: These services are managed by the Schools Broadband Team which includes the PDST, the Department and HEAnet
ga: Déanann Foireann Leathanbhanda na Scoileanna a áiríonn an PDST, an Roinn agus HEAnet na seirbhísí seo a bhainistiú

source: PDST also manages the Broadband Service Desk
ga: Ina theannta sin, bainistíonn an PDST Deasc Seirbhíse Leathanbhanda

source: This is a single point of contact for schools for all broadband related issues
ga: Pointe singil teagmhála é seo do scoileanna do gach saincheist leathanbhanda chomhghaolmhar

source: PDST is responsible for managing and developing internet safety programmes and subject modules, and advising on the development and use of Acceptable Use Policies (AUPs) in schools
ga: Tá an PDST freagrach as bainistiú agus forbairt a dhéanamh ar chláir shábháilteachta idirlín agus modúil ábhair, agus comhairle a thabhairt ar fhorbairt agus ar úsáid Polasaithe Úsáide Inghlachta (AUPanna) i scoileanna

source: Webwise, the Irish Safer Internet Centre promotes the safe, responsible use of the internet and mobile devices by children and young people
ga: Cuireann Webwise, Lárionad Idirlín Níos Sábháilte na hÉireann úsáid shábháilte, fhreagrach fearais idirlín agus shoghluaiste chun cinn i measc leanaí agus ógánach

source: It is co-funded by the European Union Safer Internet Programme and the Department
ga: Tá sé comhchistithe ag Clár Idirlín Níos Sábháilte an Aontais Eorpaigh agus ag an Roinn

source: Special education and ICT
ga: Oideachas speisialta agus TFC

source: PDST provides advice relating to the use of technology with students who have special educational needs
ga: Cuireann an PDST comhairle ar fáil maidir le húsáid teicneolaíochta le daltaí ag a bhfuil riachtanais speisialta oideachais

source: Department of Education and Skills also provide assistive technology grants for individual students with special educational needs
ga: Sa bhreis air sin, cuireann an Roinn Oideachais agus Scileanna deontais teicneolaíochta cúnta ar fáil do dhaltaí aonair ag a bhfuil riachtanais speisialta oideachais

source: Applications for this funding must be made by the local Special Educational Needs Organiser (SENO)
ga: Ní mór don Eagraí Riachtanais Speisialta Oideachais (SENO) áitiúil iarratais a dhéanamh ar an gcistiú

source: ICT in Schools Programme
ga: An Clár TFC i Scoileanna

source: The ICT in Schools Programme began in 1998
ga: Cuireadh tús leis an gClár TFC i Scoileanna i 1998

source: NCTE was set up by the Department of Education and Skills to manage the Schools IT2000 initiative and to provide support to first and second level schools integrating ICT into learning and teaching
ga: Bunaíodh an NCTE ag an Roinn Oideachais agus Scileanna chun Tionscnamh scoileanna IT2000 a bhainistiú agus chun tacaíocht a chur ar fáil do scoileanna chéad agus dara leibhéal agus TFC á chomhtháthú acu san fhoghlaim agus sa teagasc

source: In 2008, the Department published 2 reports on ICT in schools
ga: In 2008, d’fhoilsigh an Roinn 2 thuarascáil ar TFC i scoileanna

source: Investing Effectively in Information and Communications Technology in Schools 2008-2013 is the report of the strategy group appointed to advise on priorities for investment in ICT in schools
ga: Is í Innfheistíocht Éifeachtach a dhéanamh i dTeicneolaíocht Faisnéise agus Cumarsáide i Scoileanna 2008-2013 (Investing Effectively in Information and Communications Technology in Schools 2008-2013) tuarascáil an ghrúpa straitéise a ceapadh le comhairle a chur ar na tosaíochtaí d’infheisíocht i TFC i scoileanna

source: ICT in Schools is an evaluation on the impact of ICT on teaching and learning which was done by the Department’s Inspectorate
ga: Is measúnú TFC i Scoileanna ar thionchar TFC ar theagasc agus ar fhoghlaim a rinne Stiúrthóireacht na Roinne

source: In 2009, the Smart Schools = Smart Economy (pdf) report was published by the Joint Advisory Group
ga: In 2009, d’fhoilsigh an Comhghrúpa Comhairleach an tuarascáil Smart Schools = Smart Economy (pdf)

source: This Group was appointed by the then Minister to work with industry to explore possible approaches to implementing the recommendations of the 2008 Strategy Group Report
ga: Cheap an tAire um an dtaca sin an Grúpa seo chun oibriú leis an tionscal chun cur chuige féideartha a fhiosrú maidir le moltaí Thuarascáil Ghrúpa Straitéise 2008 a chur i bhfeidhm

source: Equipment grants have also been provided to schools under this programme
ga: Ina theannta sin, cuireadh deontais trealaimh ar fáil do scoileanna faoin gclár seo
